CS-3365/notes/html_output/4 - Process Activities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-27 Mon 17:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kiera" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org11bddc9">1. Process Activities</a>
<ul>
<li><a href="#org89bc460">1.1. Specification</a></li>
<li><a href="#org56f18c4">1.2. Development</a></li>
<li><a href="#org9c295b2">1.3. Validation</a></li>
<li><a href="#org9ba557c">1.4. Evolution</a></li>
</ul>
</li>
<li><a href="#org5be2516">2. Coping with Change</a>
<ul>
<li><a href="#orgbfc0d88">2.1. Software Prototyping</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org11bddc9" class="outline-2">
<h2 id="org11bddc9"><span class="section-number-2">1.</span> Process Activities</h2>
<div class="outline-text-2" id="text-1">
<p>
The four basic process activities are:
</p>
<ul class="org-ul">
<li>Specification</li>
<li>Development (Design and Implementation)</li>
<li>Validation</li>
<li>Evolution</li>
</ul>
</div>
<div id="outline-container-org89bc460" class="outline-3">
<h3 id="org89bc460"><span class="section-number-3">1.1.</span> Specification</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The characteristic of the waterfall model is that everything is pre-planned. It is beneficial to know everything upfront, as it will reduce later problems.
</p>

<p>
We come up with a <b>Requirements document</b> near the end of the waterfall model for a contract between <b>you</b> and your <b>customer</b>.
</p>
</div>
</div>
<div id="outline-container-org56f18c4" class="outline-3">
<h3 id="org56f18c4"><span class="section-number-3">1.2.</span> Development</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Software design and implementation.
</p>

<p>
Software design:
</p>
<ul class="org-ul">
<li>A software design is a description of the structure of the software to be implemented.</li>
<li>We design a software structure that realizes the specification.</li>
</ul>

<p>
Implementation:
</p>
<ul class="org-ul">
<li>Translate this structure into an executable program.</li>
</ul>

<p>
The activities of design and implemetation are closely related and may be inter-leaved.
</p>
<ul class="org-ul">
<li>The software is implemented either by developing a program (or programs) by configuring an application system.</li>
<li>Design and implementation are interleaved activities for most types of software system</li>
</ul>
</div>
</div>
<div id="outline-container-org9c295b2" class="outline-3">
<h3 id="org9c295b2"><span class="section-number-3">1.3.</span> Validation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Verification and Validation (V&amp;V) are intended to show that a system conforms to its specification and meets the standards.
</p>

<p>
Testing stages:
</p>
<ul class="org-ul">
<li>Component</li>
<li>System</li>
<li>Customer</li>
</ul>
</div>
</div>
<div id="outline-container-org9ba557c" class="outline-3">
<h3 id="org9ba557c"><span class="section-number-3">1.4.</span> Evolution</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Software is flexible and can change. This is why more and more software is being incorporated into large, complex systems.
</p>
<ul class="org-ul">
<li>Software that supports a business must also evolve and change (as business requirements change.)</li>
<li>Fewer and fewer systems are completely new in the current day.</li>
</ul>

<p>
It&rsquo;s cheaper to keep software going (as in being developed/changed) compared to making a completely new project to replace it.
</p>
</div>
</div>
</div>
<div id="outline-container-org5be2516" class="outline-2">
<h2 id="org5be2516"><span class="section-number-2">2.</span> Coping with Change</h2>
<div class="outline-text-2" id="text-2">
<p>
How do we cope with the changes in software and technology.
</p>
<ul class="org-ul">
<li>It is inevitable.</li>
<li>Business change (new changed system requirements.)</li>
<li>New technologies open (telegraph -&gt; telephone -&gt; internet &#x2026;)</li>
<li>Changing platforms require application changes.</li>
</ul>

<p>
To reduce the costs of rework:
</p>
<ul class="org-ul">
<li>Change anticipation, where the software process includes activities that can anticipate possible changes. (fucking windows microsoft ahh)</li>
<li>Change tolerance, where the process is designed so that changes can be easily made to the system. (incremental development rolling release)</li>
</ul>

<p>
<b>AI!!! BLOCKCHAIN!!! NFT!!!</b>
</p>

<ol class="org-ol">
<li>System prototyping, where a version of the software is developed quickly to check the customers requirements (and the feasability of design decisions.)</li>
<li>Incremental delivery, where system increments are delivered to the customer for comment and experimentation.</li>
</ol>
</div>
<div id="outline-container-orgbfc0d88" class="outline-3">
<h3 id="orgbfc0d88"><span class="section-number-3">2.1.</span> Software Prototyping</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A prototype is an initial version of a system used to demonstrate concepts and try out design options.
</p>
<ul class="org-ul">
<li>Requirements engineering process to help with requirements and elicitation and validation.</li>
<li>In design processes to explore and develop UI and design.</li>
<li>In the testing process to run back-to-back tests.</li>
</ul>

<p>
Benefits:
</p>
<ul class="org-ul">
<li>Improved system usability.</li>
<li>Closer match to users&rsquo; real needs.</li>
<li>Improved design quality.</li>
<li>Improved maintainability.</li>
<li>Reduced developemnt effort.</li>

<li>Establish objectives (plan)</li>
<li>Define functionality (outline definition)</li>
<li>Develop prototype</li>
<li>Evaluate prototype</li>
</ul>

<p>
Decide what to put into and what to leave out of the prototype system.
</p>

<p>
May involve leaving out functionality to reduce prototyping cost.
</p>
<ul class="org-ul">
<li>Focus on areas of the product that are not well understood.</li>
<li>Error checking and recovery is unneeded.</li>
<li>Focus on functionality rather than looks.</li>
</ul>

<p>
Throw-away:
</p>
<ul class="org-ul">
<li>Code will be messy.</li>
<li>Won&rsquo;t have documentation.</li>
<li>Structure will degrade, as it&rsquo;s simply untested.</li>
<li>Will probably not meet organisational quality standards.</li>
</ul>

<p>
Incremental Delivery advantages:
</p>
<ul class="org-ul">
<li>j</li>
</ul>

<p>
Incremental Delivery disadvantages:
</p>
<ul class="org-ul">
<li><b>PIZZA HUT</b></li>
<li>hard to identify facilities that are needed by all incremental development.</li>
<li>usually unwilling to experiment with an incomplete new system.</li>
<li>conflicts with the idea where the complete system specification is part of the system development contract.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kiera</p>
<p class="date">Created: 2025-01-27 Mon 17:49</p>
</div>
</body>
</html>
